{
  "title": "Apple display supplier could lose out on large iPhone 14 order after it was reportedly caught cutting corners",
  "url": "https://www.theverge.com/2022/5/21/23136001/apple-display-supplier-lose-out-large-iphone-14-order-caught-cutting-corners",
  "date": "2022-05-21T21:38:57.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hBKA-XDGz3hiNp9zmzOW1xr3wxw=/0x0:1998x1332/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70896209/akrales_210917_4760_0166.0.jpg\" />        <figcaption>Photo by Amelia Holowaty Krales / The Verge</figcaption>    </figure>  <p id=\"fnovrq\">Chinese display manufacturer Beijing Oriental Electronics (BOE) could lose out on 30 million display orders for the upcoming iPhone 14 after it reportedly altered the design of the iPhone 13’s display to increase yield rate, or the production of non-defective products, according to a report from <a href=\"http://www.thelec.net/news/articleView.html?idxno=4047\"><em>The Elec</em></a> (via <a href=\"https://9to5mac.com/2022/05/20/apple-display-supplier-boe/\"><em>9to5Mac</em></a>).</p><p id=\"yDKlUd\"><a href=\"https://www.macrumors.com/2021/10/13/oled-to-supply-oled-panels-iphone-13/\">Apple tasked BOE</a> with making iPhone 13 displays last October, a short-lived deal that ended earlier this month when Apple reportedly caught BOE changing the circuit width of the iPhone 13’s display’s thin-film transistors without Apple’s knowledge. (Did they really think Apple wouldn’t notice?).</p><p id=\"Yv8zIp\">This decision could continue to haunt BOE, however, as Apple may take the company off the job of making the OLED display for the iPhone 14 as well. According to <em>The Elec</em>, BOE sent an executive to Apple’s Cupertino headquarters to explain the incident and says it didn’t receive an order to make iPhone 14 displays. Apple is expected to announce <a href=\"https://www.theverge.com/2022/3/13/22975719/iphone-14-pro-max-models-a16-chip-kuo-apple-rumors\">the iPhone 14</a> at an event this fall, but <em>The Elec</em> says production for its display could start as soon as next month.</p><p id=\"ws6kBn\">In place of BOE, <em>The Elec</em> expects Apple to split the 30 million display order between LG Display and Samsung Display, its two primary display providers. Samsung will likely produce the 6.1 and 6.7-inch displays for the upcoming iPhone 14 Pro, while LG is set to make the 6.7-inch display for the iPhone 14 Pro Max. </p><p id=\"8MTfZl\">According to <a href=\"https://www.macrumors.com/2021/10/13/oled-to-supply-oled-panels-iphone-13/\"><em>MacRumors</em></a>, BOE previously only manufactured screens for refurbished iPhones. <a href=\"https://www.wired.co.uk/article/iphone-screens-boe\">Apple later hired the company</a> to supply OLED displays for the new iPhone 12 in 2020, but its first batch of panels failed to pass Apple’s rigorous quality control tests. <a href=\"http://www.thelec.net/news/articleView.html?idxno=3843\">Since the beginning</a> of this year, <a href=\"http://www.thelec.net/news/articleView.html?idxno=3999\">BOE’s output has also been affected</a> by a display driver chip shortage.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/GOWnv653UXrkPkgLv6nMfR6pgCU=/0x143:1998x1189/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22863257/akrales_210917_4760_0166.jpg",
  "description": "It reportedly altered the specs of the iPhone 13’s display.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}