{
  "title": "Apple reportedly chose a standalone AR / VR headset over a more powerful tethered design",
  "url": "https://www.theverge.com/2022/5/20/23133038/apple-mixed-virtual-augmented-reality-ar-vr-headset-self-contained-device",
  "date": "2022-05-20T22:59:43.000Z",
  "author": "Jay Peters",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/VOqQqCYuRGveV0WuzfvRIU1O-w0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70894140/acastro_180604_1777_apple_wwdc_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"ip0Le6\">Apple’s rumored mixed reality headset seems like the worst-kept secret in tech, and a new report about the device from <a href=\"https://www.theinformation.com/articles/behind-the-apple-design-decisions-that-bogged-down-its-mixed-reality-headset?rc=v4bmzs\"><em>The Information</em></a> (its <a href=\"https://www.theinformation.com/articles/the-inside-story-of-why-apple-bet-big-on-a-mixed-reality-headset\">second this week</a>) is chock full of details about the unannounced product’s turbulent development.</p><p id=\"gYip1E\">One of the most notable parts of the story is about Apple’s decision to go with a standalone headset. At one point, Apple hadn’t yet decided whether to move forward with a more powerful VR headset that would be paired with a base station or a standalone one. While Apple’s AR / VR leader Mike Rockwell apparently preferred the version with the base station — which included a processor that eventually shipped as the <a href=\"https://www.theverge.com/2022/3/9/22968611/apple-m1-ultra-gpu-nvidia-rtx-3090-comparison\">M1 Ultra</a>, according to <em>The Information</em> — Apple executives chose to go with the standalone product. <em>Bloomberg</em> reported similar details <a href=\"https://www.bloomberg.com/news/articles/2020-06-19/apple-team-working-on-vr-and-ar-headset-and-ar-glasses\">in 2020</a>.</p><p id=\"yUDl5B\">That choice has apparently had long-term effects on the development of the headset. “By the time the decision was made, the device’s multiple chips had already been in development for several years, making it impossible to go back to the drawing board to create, say, a single chip to handle all the headset’s tasks,” <em>The Information</em> reported. “Other challenges, such as incorporating 14 cameras on the headset, have caused headaches for hardware and algorithm engineers.”</p><p id=\"bOd533\">The report also includes details about Jony Ive’s continued consultation on the project’s design even after his <a href=\"https://www.theverge.com/2019/6/27/18761736/jony-ive-apple-leave-iphone-chief-design-officer-lovefrom-company-quit\">official departure from Apple</a>. Ive “prefers” a wearable battery, perhaps like <a href=\"https://www.theverge.com/2022/3/10/22969007/magic-leap-2-augmented-reality-headset\">what Magic Leap offers</a>. But other prototypes have had the battery in the headset’s headband, and it’s unclear which will be used in the final design, <em>The Information </em>says.</p><p id=\"DlOiFZ\">Apple reportedly <a href=\"https://www.theverge.com/2022/5/19/23131051/apple-vr-ar-headset-prototype-board-of-directors-demo\">showed the headset to its board of directors</a> last week, so it could be nearing a public reveal. That said, it may not be announced until later this year, and it might not hit store shelves <a href=\"https://www.theverge.com/2022/1/14/22883790/apple-virtual-augmented-mixed-reality-ar-vr-headset-launch-2023\">until 2023</a>, so we could be waiting a while to try it for ourselves. For further down the line, Apple is developing a pair of AR eyeglasses that look like Ray-Ban wayfarer glasses, but<em> The Information </em>says those are “still many years away from release.” (I’m curious how they’ll differ in style from <a href=\"https://www.theverge.com/2021/9/9/22662809/facebook-ray-ban-stories-camera-smart-glasses-hands-on\">Meta and Ray-Bans’ actual wayfarer-like glasses</a>.)</p><p id=\"uOiUSs\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/bEspe2VM_QH315QC-wUtGt5WL_c=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11477047/acastro_180604_1777_apple_wwdc_0001.jpg",
  "description": "Potential plans for a base station were scrapped.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}