{
  "title": "Apple shipped me a 79-pound iPhone repair kit to fix a 1.1-ounce battery",
  "url": "https://www.theverge.com/2022/5/21/23079058/apple-self-service-iphone-repair-kit-hands-on",
  "date": "2022-05-21T10:00:00.000Z",
  "author": "Sean Hollister",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/gIGYMaV7alQ3aS3tYEDeg6VAXQw=/0x55:2200x1522/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70894911/sean_hollister_20220510_125041.0.jpg\" />    </figure>  <p>I’m starting to think Apple doesn’t want us to repair them</p> <p class=\"p--has-dropcap p-large-text\" id=\"eqBa1N\">Apple must be joking.</p><p id=\"4r9xhg\">That’s how I felt again and again as I jumped through hoop after ridiculous hoop to replace the battery in my iPhone Mini. Part of that was the repair process — mostly, it was how difficult Apple makes it to even get there.  </p><p id=\"Imqscr\">Last month, Apple launched its Self-Service Repair program, letting US customers fix broken screens, batteries, and cameras on the latest iPhones using Apple’s own parts and tools for the first time ever. I couldn’t wait. I’d never successfully repaired a phone — and my wife has never let me live down the one time I broke her Samsung Galaxy while using a hair dryer to replace the screen. This time, armed with an official repair manual and genuine parts, I’d make it right.</p><div class=\"c-float-right c-float-hang\">  <figure class=\"e-image\">        <img alt=\"Two Pelican cases sit on a train platform, with a tiny red iPhone 13 mini next to them for scale.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/cJJkybNZ9Jq0_SZX0JOWduaWzk0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23577272/apple_repair_shoot_6.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>A repair station in a box — or two.</em></figcaption>  </figure></div><p id=\"vMATIg\">That Apple would even let me buy those parts, much less read its manuals and rent its tools, is a major change of pace for the company. For years, Apple has been <a href=\"https://www.theverge.com/2020/7/30/21348240/apple-right-to-repair-legislation-antitrust-investigation-policy\">lobbying to <em>suppress </em>right-to-repair</a> policies around the country, with the company accused of doing everything it can to keep customers from repairing their own phones. It’s easy to see this as <a href=\"https://www.theverge.com/2021/11/17/22787336/apple-right-to-repair-self-service-diy-reason-microsoft\">a huge moment for DIY advocates</a>. But having tried the repair process, I actually can’t recommend it at all — and I have a sneaking suspicion that Apple likes it that way.</p><p id=\"3bXVDB\">The thing you should understand about Apple’s home repair process is that it’s a far cry from traditional DIY if you opt for the kit — which I did, once I saw the repair manual only contains instructions for Apple’s own tools. (You can just buy a battery if you want.)</p><p id=\"TfAsSe\">I expected Apple would send me a<em> small</em> box of screwdrivers, spudgers, and pliers; I own a mini iPhone, after all. Instead, I found two giant Pelican cases — <em>79 pounds of tools </em>— on my front porch. I couldn’t believe just how big and heavy they were considering Apple’s paying to ship them both ways.</p><p id=\"6aoyqf\">I lugged those cases onto a BART train to San Francisco and dragged them down the streets to our office. Then, I set everything out on a table and got started.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ypwVHaPKZjoLy_NJS-o0Xvjbwvs=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23545598/sean_hollister_20220510_121054.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Apple’s Self-Service Repair kit laid out on a table.</em></figcaption>  </figure></div><p id=\"yiUyJM\">Step one of opening an iPhone is, basically, using a hefty machine to suck the screen off the top. Here, I wasn’t <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.ifixit.com%2FStore%2FTools%2FiOpener%2FIF145-198%3Futm_source%3Dgoogle%26utm_medium%3Dcpc%26utm_campaign%3D9790357365%26gclid%3DCjwKCAjwj42UBhAAEiwACIhADuiyhpXPxR9nP4OExKkyHn6EfHCpUiw7q78eDHSNp8ItwSxnW3zrPhoCjhUQAvD_BwE%26o%3D9&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F21%2F23079058%2Fapple-self-service-iphone-repair-kit-hands-on\" rel=\"sponsored nofollow noopener\" target=\"_blank\">microwaving a jelly-filled sock</a> to loosen the Apple goop holding my screen down! Apple lets you rent an industrial-grade heat station that looks like a piece of lab equipment, right down to the big red safety dial you twist to release the emergency-off button and the suction-cup-tipped mechanical lifting arm. It looks pretty cool.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/CeYUFHIpiZe3ptTRahdYTRqhz1w=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23545610/apple_repair_shoot_2.jpg\">      <cite>Photo by Thomas Blythe / The Verge</cite>      <figcaption><em>Hot pocket!</em></figcaption>  </figure><p id=\"8P5Xmf\">I slip my phone in a perfectly sized “heating pocket” that clamps a ring of copper around the iPhone’s band to evenly distribute the heat and melt the seal around the screen, realize in horror that I’ve invited <a href=\"https://www.youtube.com/watch?v=FeS0CcpRbGE\">the “Hot Pockets!” jingle</a> to live in my head rent-free, then spin a dial to raise the arm that separates the iPhone’s screen from its body.</p><p id=\"vHQpXI\">Or, that’s how it’s supposed to work, anyhow. The heating machine threw an error code partway through my first attempt, and Apple’s manual didn’t explain what to do if that happens <em>after</em> you’ve stuck your phone inside. So I wound up heating it twice in a row. And yet, that still wasn’t quite enough for my screen to “immediately” pop up when the suction cup arm began to lift the glass. The manual <em>did</em> cover that situation, making me spin a second hidden knob to put more pressure on the suction cup, but I started freaking out when I saw what looked like cracks spider across the screen. (It turned out it was just suction cup residue.)</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/0IipKyp9BIbnfGqmGa3HQvmQwi8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23551037/apple_repair_shoot_4.jpg\">      <cite>Still by Thomas Blythe / The Verge</cite>      <figcaption><em>Here’s the suction cup arm.</em></figcaption>  </figure></div><p id=\"k6Me09\">Once the screen was loose, I cut through the softened glue holding it to the iPhone’s frame with Apple’s single tiny adhesive cutter, which also gave me a little trouble. The blade got caught when I wedged it under the corners of the screen, and I had to yank it out without accidentally sending my phone clattering to the ground. The kit comes with a perfect-fit tray to hold your phone steady and extra suction cups to hold the screen without stretching the fragile ribbon cables but nothing to hold the tray itself. </p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/_Mc-1E_bTWF1ETW7lj_tGFySg1M=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23554301/apple_manual_pic_iphone_13_mini_1.jpg\">      <cite>Image: Apple</cite>      <figcaption><em>The manual pictures a technician holding the screen with one hand while cutting adhesive with the other, but I also had to hold the tray to keep it from sliding around.</em></figcaption>  </figure><p id=\"CtCbZI\">Apple also provides a set of fancy torque drivers to make sure you don’t screw down the phone’s tiny screws too tightly, but it’s a bit of a chore. I must have dropped Apple’s incredibly tiny fasteners a dozen times while removing the slivers of metal that hold the screen’s ribbon cables in place, as well as the bottom speaker that Apple makes you yank to get at the battery. Presumably just to make it more difficult to repair, Apple requires three different screwdriver bits just to remove the screen, and none of Apple’s bits are magnetized to keep the screws from slipping.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ceZh6qTA-kK7p5ksZl4qwcAXenk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23545609/apple_shoot_1.jpg\">      <cite>Photo by Thomas Blythe / The Verge</cite>      <figcaption><em>The torque driver has several swappable bits, and you’ll need at least three. </em></figcaption>  </figure></div><p id=\"TXbYa8\">At this point, there was still a bunch of goopy adhesive around the sides of my iPhone’s frame. While instructions suggest it’ll just peel off in a few big pieces if you pull with tweezers (<em>which didn’t come in the box</em>), I gave up after 10 minutes of picking away at tiny fuzzy blobs of glue. I was just going to be adding more adhesive anyway, after all. Later, I discovered this was not my best idea.</p><p id=\"JZ1Xrs\">When it finally lay open on the table, I couldn’t help but gawk in wonder at my iPhone 13 Mini’s precisely packed guts, and I realized I was having fun! Slicing open my phone was a thrill. But a lot of that thrill came from not knowing whether my phone would survive surgery — Apple tools or no.</p><div class=\"p-fullbleed-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/YKDp-HznMBYC0rie0Zx7jTxrxe0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23552350/PXL_20220510_212702984.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Still photos don’t do it justice — particularly not mine.</em></figcaption>  </figure></div><p id=\"HxlTuB\">From there, it was time to swap out the battery. Once I finished cursing at the far too easy to tear tabs that held in the original lithium pack, I used Apple’s fancy battery press with a rolling arm to seat — but <em>not </em>squish — the new battery down. But I could have done that with my fingertips; I’d have much rather had a tool to properly <em>align</em> the battery, which I had to yank and reposition after plopping it down a millimeter too far south, or a tool to test whether you’ve properly reseated the battery and display connectors. But I’ll get to that.</p><p id=\"05fyKg\">Next, the instructions had me apply an <em>actually helpful</em> precut adhesive sheet designed to stick my screen back to the frame, which was easy to slot into exactly the right place and press down with my fingers. Then came a huge spring-loaded press (with a veritable slot machine of an arm) to close the phone once more. But even with the press, my screen wasn’t perfectly flush with the frame afterwards, perhaps due to the extra glue I didn’t manage to remove.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/Xo21wuCLOyNQcDfvjFaBvIw8ry0=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576684/apple_repair_shoot_5__1_.jpg\">      <cite>Photo by Thomas Blythe / The Verge</cite>      <figcaption><em>Apple’s screen press is a one-armed bandit.</em></figcaption>  </figure></div><p id=\"1fGgKR\">With my phone closed up again, I held down the power button. Nothing. No bright white Apple logo — no response at all. For one horrible moment, I realized Apple gave me no way to test whether the battery and display connectors were actually seated (they probably weren’t) and had me close up the phone anyhow.</p><p id=\"bNGSbs\">Then, a forlorn hope: maybe the replacement battery shipped empty? I scrambled around the office for a Lightning cable, and… my iPhone 13 Mini finally lit up.</p>  <figure class=\"e-image\">        <img alt=\"You can’t get Apple to validate your repair using your repaired phone — you need a separate device, an agent explained to me in chat\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/fvqhgn7leZlVEeAjDzbJ5fM-YgY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576666/PXL_20220510_222929558__1_.jpg\">      <cite>Photo by Sean Hollister / The Verge</cite>      <figcaption><em>Sorry, Brian, you did your best.</em></figcaption>  </figure><p id=\"QlxBTg\">But I wasn’t done yet. The single most frustrating part of this process, after using Apple’s genuine parts and Apple’s genuine tools, was that my iPhone didn’t recognize the genuine battery as genuine. “Unknown Part,” flashed a warning. Apparently, that’s the case for almost <em>all</em> of these parts: you’re expected to dial up Apple’s third-party logistics company after the repair so they can validate the part for you. That’s a process that involves having an entirely separate computer and a Wi-Fi connection since you have to reboot your iPhone into diagnostics mode and give the company remote control. Which, of course, defeats a bunch of the reasons you’d repair your own device at home!</p><p id=\"lmDgvS\">And, if I’m telling you the truth, the <em>second</em> most frustrating part didn’t occur during the repair either. If it were just me, I’d have aborted the entire process before Apple ever shipped 79 pounds of equipment to my home.</p><p id=\"haHpRH\">It would be an understatement to say that Apple has a history of resisting right-to-repair efforts. Before the iPhone, replacing a battery was typically as easy as <em>inserting a thumbnail </em>to pop off your phone’s back cover; afterwards, phones largely became tricky to even open without specialized tools, <a href=\"https://www.theverge.com/2017/8/3/16087628/apple-e-waste-environmental-standards-ieee-right-to-repair\">which arguably pushed customers</a> to replace their perfectly good devices when they might have only needed a new screen or battery. Also see: <a href=\"https://www.theverge.com/2020/11/18/21573710/apple-battery-gate-throttle-iphones-settlement-amount\">batterygate</a>.</p><div class=\"c-float-right c-float-hang\"><aside id=\"KhDixl\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"The shareholder fight that forced Apple’s hand on repair rights\",\"url\":\"https://www.theverge.com/2021/11/17/22787336/apple-right-to-repair-self-service-diy-reason-microsoft\"},{\"title\":\"The era of fixing your own phone has nearly arrived\",\"url\":\"https://www.theverge.com/23017361/ifixit-right-to-repair-parts-google-samsung-valve-microsoft\"}]}'></div></aside></div><p id=\"Bm4fxV\">In recent years, the company has <a href=\"https://www.theverge.com/2020/7/30/21348240/apple-right-to-repair-legislation-antitrust-investigation-policy\">actively lobbied against right-to-repair legislation in at least 20 states</a>, sneakily pushing California, as one example, <a href=\"https://www.theverge.com/2019/5/1/18525542/apple-right-to-repair-bill-california-lobbyist-comptia\">to postpone its bill</a>. (The bill <a href=\"https://calpirg.org/news/cap/california-right-repair-bill-dies-senate-committee\">died in committee again this very week</a>.) Apple cracked down on unauthorized repairs by <a href=\"https://www.theverge.com/2019/9/25/20884287/apple-iphone-11-pro-max-display-screen-replacement-verification-warning\">throwing warnings</a> or even disabling features if you repair phones with non-“genuine” parts, though it <a href=\"https://www.theverge.com/2021/11/9/22772433/apple-iphone-13-screen-replacements-face-id-software-update\">walked some of that back</a> after an outcry. And it put together <a href=\"https://www.theverge.com/2020/2/6/21126970/apple-iphone-independent-repair-contract-search-audit\">a contract for indie repair shops that was reportedly so invasive</a>, many refused to sign it.</p><p id=\"Laf1sB\">So, it didn’t surprise me when Apple’s press release about the program warned “the vast majority of customers” away from their own repairs, or when I needed to enter my phone’s IMEI to prove I owned my phone, or how I had to enter a six-digit code to prove I read the repair manual, which <em>not only</em> suggests you need three pages worth of tools but also a jar of sand in case your battery catches fire — one of many not strictly necessary items that <em>don’t</em> come with the kit. Apple also only includes instructions on how to use its own special tools for repairs, so you’re on your own if you want to try a more low-key or inexpensive DIY approach.</p><p id=\"SfsnK0\">Yeah, none of that surprised me. What surprised me was the price tag.</p><ul><li id=\"hiXURz\">$69 for a new battery — the same price the Apple Store charges for a battery replacement, except here I get to do all the work and assume all the risk. </li><li id=\"cGz0r2\">$49 to rent Apple’s tools for a week, more than wiping out <a href=\"https://www.theverge.com/2022/4/27/23044490/apple-diy-repair-self-service-replacement-part-price-apple-store\">any refund I might get</a> for returning the old used part. </li><li id=\"g44RP0\"><em>A $1,200 credit card hold</em> for the toolkit, <em>which I would forfeit</em> if the tools weren’t returned within seven days of delivery. </li></ul><p id=\"bQ9MsQ\">Let’s be clear: this is a<em> </em>ridiculous amount of risk for the average person who just wants to put a new battery in their phone. And it’s frankly weird for Apple <a href=\"https://www.selfservicerepair.com/tool-kit-rental\">to insist on you covering</a> the full value of the tools. “It’s not like when you rent a car they make you put down $20,000 as a safety deposit,” my colleague Mitchell Clark points out. </p><p id=\"BaJcu2\">I should also mention the Pelican cases landed at my door two days before the battery arrived, so I only had five days to do the job before that $1,200 deadline.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\"The fine print basically says I have seven days to return the toolkit or I might be out twelve hundred bucks.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5DDUTiReY3W4ZN6p_d-2Pbrrhw8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23576685/2022_04_27_16_57_34_RvS5pqa6lE.jpg\">      <cite>Screenshot by Sean Hollister / The Verge</cite>      <figcaption><em>My shopping cart. Get a load of the fine print.</em></figcaption>  </figure></div><p id=\"bdhme9\">The more I think about it, the more I realize Apple’s Self-Service Repair program is the perfect way to make it look like the company supports right-to-repair policies without actually encouraging them at all. Apple can say it’s giving consumers access to everything, even the same tools its technicians use, while scaring them away with high prices, complexity, and the risk of losing a $1,200 deposit. This way, Apple gets credit for walking you through an 80-page repair, instead of building phones where — say — you don’t need to remove the phone’s most delicate components and two different types of security screws just to replace a battery.</p><div class=\"c-float-right c-float-hang\"><aside id=\"0R9aK2\"><q>Shipping two 40-pound Pelicans can’t be cheap</q></aside></div><p id=\"Z82JUO\">To me, those giant Pelican cases are the proof. It would cost Apple a fortune to ship 79 pounds of equipment to individual homes all over the country, even with corporate discounts. <em>The Verge</em> is obviously <em>far, far</em> smaller than Apple, but it would cost us upwards of $200 just to return those cases to their sender. Yet Apple offers free shipping <em>both </em>directions with your $49 rental, plus a dedicated support team to validate your parts and facilitate returns. (Though, apparently, it doesn’t do the latter anywhere near its Silicon Valley HQ: when I took the support team up on its offer of picking up my battery, they told me they didn’t have a driver within 250 miles of my location, and I should just drop it off at the nearest Home Depot.)</p><p class=\"c-end-para\" id=\"vJy7zU\">I don’t think Apple expects anyone to seriously take it up on the offer of self-service repair kits. It stacked the deck in favor of taking your phone to an Apple Store, where it can tempt you to buy something new instead. The real victory will come months or years down the road, though. That’s when Apple can tell legislators it <em>tried</em> to give right-to-repair advocates what they wanted — but that consumers overwhelmingly decided Apple knows best.</p><p id=\"ykRxJD\"></p><p id=\"Ch6OqO\"></p><p id=\"1G9lvt\"></p><p id=\"zyceB4\"></p><p id=\"eur8e4\"></p><p id=\"6I6m6d\"></p><p id=\"VoZfNq\"></p><p id=\"pA8mSZ\"></p><p id=\"PMqbkT\"></p><p id=\"fqEsuE\"></p><p id=\"gjuLuo\"></p><p id=\"occd0Q\"></p><p id=\"H04wBI\"></p><p id=\"V82Uva\"></p><p id=\"8ZR3P3\"></p><p id=\"veK4Ei\"></p><p id=\"uYO2eU\"></p><p id=\"p3rRwD\"></p><p id=\"hst8Zj\"></p><p id=\"rpifdj\"></p><p id=\"514U4n\"></p><p id=\"UUwyDC\"></p><p id=\"icifYl\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/w4Es-UP6o4wdxPMJDafND-_Evaw=/0x212:2200x1364/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23488982/sean_hollister_20220510_125041.jpg",
  "description": "Nobody should do it this way.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}