{
  "title": "Boeing’s Starliner successfully docks to the International Space Station for the first time",
  "url": "https://www.theverge.com/2022/5/20/23132777/boeing-cst-100-starliner-nasa-iss-docking-success-oft-2",
  "date": "2022-05-21T00:50:33.000Z",
  "author": "Loren Grush",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/SIFMIKsmpgh0VXig2g83SbCiGuM=/175x0:2011x1224/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70894337/Screen_Shot_2022_05_20_at_7.27.32_PM.0.png\" />        <figcaption><em>Boeing’s Starliner coming in for docking, as seen from the International Space Station</em> | Image: NASA TV</figcaption>    </figure>  <p id=\"KcNn8K\">This evening, Boeing’s new passenger spacecraft, the CST-100 Starliner, successfully docked itself to the International Space Station — demonstrating that the vehicle can potentially bring humans to the ISS in the future. It’s a crucial capability that Starliner has finally validated in space after years of delays and failures.</p><p id=\"7ef5AJ\">Starliner is in the midst of a key test flight for NASA called OFT-2, for Orbital Flight Test-2. The capsule, developed by Boeing for NASA’s Commercial Crew Program, was made to transport NASA’s astronauts to and from the space station. But before anyone climbs on board, NASA tasked Boeing with conducting an uncrewed flight demonstration of Starliner to show that the capsule can hit all of the major milestones it’ll need to hit when it is carrying passengers.</p><p id=\"XPeI8u\">Boeing has struggled to showcase Starliner’s ability until now. This mission is called OFT-2 since <a href=\"https://www.theverge.com/2022/5/19/23075086/boeing-cst-100-starliner-nasa-commercial-crew-oft-2-iss\">it’s technically a do-over of a mission that Boeing attempted back in 2019</a>, called OFT. During that flight, Starliner launched to space as planned, but a software glitch prevented the capsule from getting in the right orbit it needed to reach to rendezvous with the ISS. Boeing had to bring the vehicle home early, and the company never demonstrated Starliner’s ability to dock with the ISS.</p><div class=\"c-float-right\"><aside id=\"AMJ5UV\"><q>“Boeing Starliner spacecraft completes its historic first docking to the International Space Station.”</q></aside></div><p id=\"Zl7f2D\">Now, roughly two and a half years later, Starliner has finally shown what it was designed to do. Using a series of sensors, the capsule autonomously guided itself onto an open docking port on the space station. “Boeing Starliner spacecraft completes its historic first docking to the International Space Station opening a new avenue of access for crews to the orbiting laboratory,” Steve Siceloff, a communications representative for Boeing, said during the livestream of the docking. Docking occurred a little over an hour behind schedule, due to some issues with Starliner’s graphics and docking ring, which were resolved ahead of the docking.</p>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/vLoKnordWjCkgHIyMYNI42dwBl8=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23578452/Screen_Shot_2022_05_20_at_7.35.10_PM.png\">      <cite>Image: NASA TV</cite>      <figcaption><em>Starliner docked with the International Space Station</em></figcaption>  </figure><p id=\"Ee48oi\">There was some concern about Starliner’s ability to dock with the space station after Boeing revealed some issues with the capsule’s thrusters yesterday. At 6:54PM ET, Starliner <a href=\"https://www.theverge.com/2022/5/19/23131232/boeing-cst-100-starliner-launch-success-iss-nasa-oft-2\">successfully launched to space on top of an Atlas V rocket</a>, built and operated by the United Launch Alliance. Once Starliner separated from the Atlas V, it had to fire its own thrusters to insert itself into the proper orbit for reaching the space station. However, after that maneuver took place, Boeing and NASA revealed that two of the 12 thrusters Starliner uses for the procedure failed and cut off too early. The capsule’s flight control system was able to kick in and rerouted to a working thruster, which helped get Starliner into a stable orbit.</p><p id=\"OHRdTR\">Ultimately, NASA and Boeing claimed that the issue should not impact the rest of Starliner’s mission. “There’s really no need to resolve them,” Steve Stich, NASA’s program manager for the Commercial Crew Program, said in a press conference after the flight. “But I know what the teams will do, and what we always do is we’ll go look at the data, try to understand what happened.” Today, Boeing revealed that a drop in chamber pressure had caused the early cutoff of the thruster, but that system behaved normally during follow-up burns of the thrusters. And with redundancies on the spacecraft, the issue “does not pose a risk to the rest of the flight test,” according to Boeing.</p><div class=\"c-float-left\"><aside id=\"Yj1RnP\"><q>with Starliner docked to the space station, it’ll stick around for the next four to five days</q></aside></div><p id=\"AffJle\">Boeing also noted today that the Starliner team is investigating some weird behavior of a “thermal cooling loop” but said that temperatures are stable on the spacecraft. </p><p id=\"V7FS8Z\">Now, with Starliner docked to the space station, it’ll stick around for the next four to five days. Tomorrow morning, the astronauts already on board the ISS will open the hatch to the vehicle and retrieve some cargo that’s packed inside. Also inside Starliner is a mannequin called Rosie the Rocketeer, simulating what it would be like for a human to ride inside the vehicle.</p><p id=\"stFpxj\">After its brief stay on the ISS, Starliner will detach from the ISS and distance itself from the station for its return home. The capsule will use its thrusters to take itself out of orbit and put it on course for Earth. The two thrusters that failed are the same kind used for this deorbit maneuver, but NASA and Boeing did not seem concerned. “We’ll just have to see if we can recover the thrusters,” Stich said. He also noted that the working thrusters could be used and that Boeing has the option to use a different set of thrusters to perform the task if needed. “So there’s plenty of redundancy in the spacecraft.”</p><p id=\"6Qb8EH\">For now, the Starliner team is celebrating their big milestone. “Today marks a great milestone towards providing additional commercial access to low Earth orbit, sustaining the ISS and enabling NASA’s goal of returning humans to the Moon and eventually to Mars,” NASA astronaut Bob Hines, currently on board the space station, said after the docking. “Great accomplishments in human spaceflight are long remembered by history. Today will be no different.”</p><p id=\"iFnbep\"> </p><p id=\"jkyQMe\"></p><p id=\"9arMyL\"></p>",
  "image": "https://cdn.vox-cdn.com/thumbor/q7qqdjN523T_plMMIWQY21HfK4I=/0x40:2186x1185/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23578443/Screen_Shot_2022_05_20_at_7.27.32_PM.png",
  "description": "It’s a maneuver that’s been a long time coming.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}