{
  "title": "Crypto exchange FTX is getting into stock trading",
  "url": "https://www.theverge.com/2022/5/21/23135897/crypto-exchange-ftx-getting-into-stock-trading",
  "date": "2022-05-21T17:58:51.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/hhF6N3XtZkZRtgW6Zqi9lCO_I-E=/0x0:3000x2000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70895777/acastro_170726_1777_0007_v5.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"cOznTY\">Cryptocurrency exchange FTX will soon allow for traditional stock trading alongside its crypto offerings, the company announced in a <a href=\"https://www.prnewswire.com/news-releases/ftx-us-launches-ftx-stocks-offering-trading-on-us-listed-equities--etfs-301550852.html\">press release</a> (via <a href=\"https://www.wsj.com/articles/crypto-exchange-ftx-expands-into-stock-trading-11652954400\"><em>The Wall Street Journal</em></a>). The functionality is currently available to a select number of users in the US, but it’s aiming to roll it out to more traders in the coming months.</p><p id=\"Tyj6m6\">FTX says it will offer commission-free trading with access to “hundreds of US exchange-listed securities” including both common stocks and ETFs. It will let customers add money to their accounts through credit card deposits, ACH transfers, and wire transfers. FTX also says it’s the first exchange to let users fund their accounts with fiat-backed stablecoins, such as USDC. While the price of stablecoins isn’t (theoretically) supposed to fluctuate as much as other cryptocurrencies because they’re pegged to a currency or commodity, a recent dip in the overall crypto market has left <a href=\"https://www.theverge.com/2022/5/16/23075139/stablecoin-terra-crash-depeg-dei-fantom-usd-scream-defi-instability\">some stablecoins struggling</a>.</p><div class=\"c-float-right\"><aside id=\"8qKKJZ\"><q>FTX plans on routing orders directly through the Nasdaq exchange</q></aside></div><p id=\"8jHhrX\">FTX plans on routing orders directly through the Nasdaq exchange, instead of using the <a href=\"https://www.vox.com/ad/22960319/pfof-payment-for-order-flow-trading-commission-public\">payment for order flow (PFOF)</a> method employed by Robinhood and other exchanges. PFOF involves brokerages receiving compensation for directing orders to market makers, a process critics say could <a href=\"https://www.ft.com/content/696a15e0-64f1-4800-af79-4d0a882df5b2\">pose a conflict of interest</a>, as brokers may want to direct orders to institutions that increase their profits. The practice came under scrutiny <a href=\"https://www.theverge.com/22251427/reddit-gamestop-stock-short-wallstreetbets-robinhood-wall-street\">following the GameStop stock surge</a> that occurred last year.</p><p id=\"Xhg5CZ\">“With the launch of FTX Stocks, we have created a single integrated platform for retail investors to easily trade crypto, NFTs, and traditional stock offerings through a transparent and intuitive user interface,” Brett Harrison, the US president of FTX said in a statement. </p><p id=\"AGmb3A\">Robinhood, the <a href=\"https://www.theverge.com/2021/12/1/22812752/square-changing-name-block-jack-dorsey-cash-app-tidal-crypto-spiral\">Block-owned</a> Cash App, and <a href=\"https://go.redirectingat.com?id=66960X1514734&amp;xs=1&amp;url=http%3A%2F%2Fpublic.com%2F&amp;referrer=theverge.com&amp;sref=https%3A%2F%2Fwww.theverge.com%2F2022%2F5%2F21%2F23135897%2Fcrypto-exchange-ftx-getting-into-stock-trading\" rel=\"sponsored nofollow noopener\" target=\"_blank\">Public.com</a> also let users trade stock and crypto — throwing FTX into the mix will let it compete directly with each platform. Earlier this month, Sam Bankman-Fried, the founder of FTX, <a href=\"https://www.wsj.com/articles/ftx-ceo-and-emergent-fidelity-disclose-7-6-stake-in-robinhood-11652391400\">disclosed his purchase of a 7.6 percent stake in Robinhood</a>, making him the company’s third-largest shareholder. In Bankman-Fried’s 13D filing, he said he had no plans to acquire the company at this time, but as the <em>WSJ</em> points out, this type of form is typically filed by an investor looking to purchase more shares of a company or execute a takeover.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/nFXmUqSi5kTnvjpfys-lU0mOu1A=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8937285/acastro_170726_1777_0007_v5.jpg",
  "description": "Stock trading is currently available to a small group of users.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}