{
  "title": "Twitter’s latest update will make third party apps better",
  "url": "https://www.theverge.com/2022/5/20/23132871/twitter-reverse-chronological-timeline-api-v2-third-party-developers-support",
  "date": "2022-05-20T22:00:45.000Z",
  "author": "Mitchell Clark",
  "content": "      <figure>      <img alt=\"The Twitter bird logo in white against a dark background with outlined logos around it and red circles rippling out from it.\" src=\"https://cdn.vox-cdn.com/thumbor/BtbQ6o1fKttubfhPTW1LuA6lImY=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70893900/acastro_180827_1777_0001.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"1p1PwR\">Twitter <a href=\"https://twitter.com/TwitterDev/status/1527691246449225728\">announced an update on Friday</a> that should significantly improve the experience inside third-party Twitter apps: it’s giving developers far more access to its reverse chronological timeline. This update to Twitter’s recently launched API v2, the interface that developers use to get data from Twitter, is a new (and, in my opinion, encouraging) step in Twitter’s journey to better support developers.</p><p id=\"dWxpeS\">As Twitter notes <a href=\"https://twittercommunity.com/t/reverse-chronological-home-timeline-in-the-twitter-api-v2/171549\">in its announcement post</a>, the new API v2 feature gives developers a way to “retrieve the most recent Tweets and Retweets posted by the authenticated user and the accounts they follow.” In other words, a developer can ask to see the data that Twitter shows you when you load up the first party app with the <a href=\"https://www.theverge.com/2022/3/14/22977782/twitter-default-home-algorithmic-timeline-feed-reverse-chronological\">“Latest Tweets” option selected</a>, so their app can show it to you instead. </p><div class=\"c-float-right\"><aside id=\"Y65Z0Y\"><q>It’ll improve the experience for both developers and users</q></aside></div><p id=\"IdQUL7\">For third party clients like Tweetbot, the feature (or “endpoint” in developer parlance) is a very welcome one. Paul Haddad, one of Tweetbot’s developers, is quoted in Twitter’s announcement as saying that the old way to get a user’s time line “is one of our most used API calls.” The old version of the API was <a href=\"https://developer.twitter.com/en/docs/twitter-api\">launched in 2012</a>, so it was definitely getting long in the tooth — and developers using it faced more limits when trying to get a user’s timeline.</p><p id=\"IlUjp1\">In an email to<em> The Verge</em>, Haddad explained that the change will make Tweetbot more responsive for users. “We’ll simply be able to refresh the timeline more often and allow users to scroll much further back in their timeline,” thanks to the fact that API v2 lets developers make more requests in a few ways. The old version, API v1.1, <a href=\"https://developer.twitter.com/en/docs/twitter-api/v1/tweets/timelines/api-reference/get-statuses-home_timeline\">let you request</a> the home timeline 15 times in a 15 minute window, and could return up to 800 tweets. API v2 supports up to 180 requests per user in that same timeframe, and retrieves 3,200 tweets.</p><p id=\"6bZcV3\">From a development standpoint, he says, it makes things much simpler. “We currently use the v1.1 home timeline API to get a list of Tweets and then v2 APIs to fill in any v2 specific data (polls, cards, metrics, etc…). With this new v2 version we can get all that data in a single step.”</p><p id=\"mJ58fv\">Throughout v2’s rollout (it <a href=\"https://www.theverge.com/2020/8/12/21364644/twitter-api-v2-new-access-tiers-developer-portal-support-developers\">went into testing in 2020</a>, and was launched as the main way to interface with Twitter <a href=\"https://www.theverge.com/2021/11/15/22779149/twitter-api-version-2-official-decentralized\">late last year</a>), Twitter has made one thing very clear: it’s trying to make amends with developers, after years of making new features exclusive to its first party app. The company even removed restrictions from its terms of service that made it more difficult for third party clients to compete with the official app, such as limits to the number of users they could have.</p><p id=\"RAWof8\">Talk is cheap, and it wouldn’t be surprising if some developers weren’t sure whether Twitter was actually committed. But with Friday’s announcement, the company seems to be showing that it’s continuing the trend of giving developers access to crucial features, and Haddad says that it’s “noteworthy” that Twitter actually built and released a home timeline API for v2. “There’s a number of uses for this API but a big one is for third-party Twitter clients to be Twitter clients. The fact that they released this is an indication that they’re going to continue to allow and even encourage alternative clients.”</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/2z0nkeOqAbnZqe1cJriMBz4J4Lg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12645587/acastro_180827_1777_0001.jpg",
  "description": "It’ll be easier to get a proper timeline in third party apps.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}